I have tested this with the configuration below and I am unable to reproduce the optional args being required.  Is there anything else on the outbound queue which necessitates the queue config on your side ?
```
resource "awscc_connect_routing_profile" "routing_profile" {
  instance_arn = awscc_connect_instance.example.arn

  name                       = "example"
  description                = "example"
  default_outbound_queue_arn = awscc_connect_queue.example.id
  media_concurrencies        = [{
    channel = "VOICE"
    concurrency = 1
    cross_channel_behavior = {
      behavior_type = "ROUTE_CURRENT_CHANNEL_ONLY"
    }
  }]
  agent_availability_timer = "TIME_SINCE_LAST_ACTIVITY"

  tags = [{
    key   = "managed_by"
    value = "quixoticmonk"
  }]
}

```

TF workflow output

```
  # awscc_connect_routing_profile.routing_profile will be created
  + resource "awscc_connect_routing_profile" "routing_profile" {
      + agent_availability_timer   = "TIME_SINCE_LAST_ACTIVITY"
      + default_outbound_queue_arn = "arn:aws:connect:us-east-1:############:instance/d9d0de37-d138-47d9-a4f9-1ce24fe02a02/queue/0d6cabed-d957-4a0f-b1c9-6c9d40d9f008"
      + description                = "example"
      + id                         = (known after apply)
      + instance_arn               = "arn:aws:connect:us-east-1:############:instance/d9d0de37-d138-47d9-a4f9-1ce24fe02a02"
      + media_concurrencies        = [
          + {
              + channel                = "VOICE"
              + concurrency            = 1
              + cross_channel_behavior = {
                  + behavior_type = "ROUTE_CURRENT_CHANNEL_ONLY"
                }
            },
        ]
      + name                       = "example"
      + queue_configs              = (known after apply)
      + routing_profile_arn        = (known after apply)
      + tags                       = [
          + {
              + key   = "managed_by"
              + value = "quixoticmonk"
            },
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.
awscc_connect_routing_profile.routing_profile: Creating...
awscc_connect_routing_profile.routing_profile: Creation complete after 6s [id=arn:aws:connect:us-east-1:############:instance/d9d0de37-d138-47d9-a4f9-1ce24fe02a02/routing-profile/37c02b57-1191-4495-975d-b8c56ab752b7]

```